Masmiseim36/nxpSDK/boards/twrkv46f150m/demo_apps/mc_bldc/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
PinTool_PWM:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '93', peripheral: FTM0, signal: 'CH, 0', pin_signal: PTD0/LLWU_P12/SPI0_PCS0/FTM3_CH0/FTM0_CH0/FlexPWM_A0, direction: OUTPUT}
  - {pin_num: '95', peripheral: FTM0, signal: 'CH, 2', pin_signal: PTD2/LLWU_P13/SPI0_SOUT/FTM3_CH2/FTM0_CH2/FlexPWM_A1/I2C0_SCL, direction: OUTPUT}
  - {pin_num: '97', peripheral: FTM0, signal: 'CH, 4', pin_signal: PTD4/LLWU_P14/SPI0_PCS1/UART0_RTS_b/FTM0_CH4/FlexPWM_A2/EWM_IN/SPI0_PCS0, direction: OUTPUT}
  - {pin_num: '94', peripheral: FTM0, signal: 'CH, 1', pin_signal: ADCA_CH7f/PTD1/SPI0_SCK/FTM3_CH1/FTM0_CH1/FlexPWM_B0, direction: OUTPUT}
  - {pin_num: '96', peripheral: FTM0, signal: 'CH, 3', pin_signal: PTD3/SPI0_SIN/FTM3_CH3/FTM0_CH3/FlexPWM_B1/I2C0_SDA, direction: OUTPUT}
  - {pin_num: '98', peripheral: FTM0, signal: 'CH, 5', pin_signal: ADCA_CH6g/PTD5/SPI0_PCS2/UART0_CTS_b/UART0_COL_b/FTM0_CH5/FlexPWM_B2/EWM_OUT_b/SPI0_SCK, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : PinTool_PWM
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void PinTool_PWM(void)
{
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);

    /* PORTD0 (pin 93) is configured as FTM0_CH0 */
    PORT_SetPinMux(PINTOOL_PWM_PWM_A0_PORT, PINTOOL_PWM_PWM_A0_PIN, kPORT_MuxAlt5);

    /* PORTD1 (pin 94) is configured as FTM0_CH1 */
    PORT_SetPinMux(PINTOOL_PWM_PWM_B0_PORT, PINTOOL_PWM_PWM_B0_PIN, kPORT_MuxAlt5);

    /* PORTD2 (pin 95) is configured as FTM0_CH2 */
    PORT_SetPinMux(PINTOOL_PWM_PWM_A1_PORT, PINTOOL_PWM_PWM_A1_PIN, kPORT_MuxAlt5);

    /* PORTD3 (pin 96) is configured as FTM0_CH3 */
    PORT_SetPinMux(PINTOOL_PWM_PWM_B1_PORT, PINTOOL_PWM_PWM_B1_PIN, kPORT_MuxAlt5);

    /* PORTD4 (pin 97) is configured as FTM0_CH4 */
    PORT_SetPinMux(PINTOOL_PWM_PWM_A2_PORT, PINTOOL_PWM_PWM_A2_PIN, kPORT_MuxAlt4);

    /* PORTD5 (pin 98) is configured as FTM0_CH5 */
    PORT_SetPinMux(PINTOOL_PWM_PWM_B2_PORT, PINTOOL_PWM_PWM_B2_PIN, kPORT_MuxAlt4);

    SIM->SOPT8 =
        ((SIM->SOPT8 &
          /* Mask bits to zero which are setting */
          (~(SIM_SOPT8_FTM0OCH0SRC_MASK | SIM_SOPT8_FTM0OCH1SRC_MASK | SIM_SOPT8_FTM0OCH2SRC_MASK | SIM_SOPT8_FTM0OCH3SRC_MASK | SIM_SOPT8_FTM0OCH4SRC_MASK | SIM_SOPT8_FTM0OCH5SRC_MASK)))

         /* FTM0 channel 0 output source: FTM0_CH0 pin is output of FTM0 channel 0 output. */
         | SIM_SOPT8_FTM0OCH0SRC(SOPT8_FTM0OCH0SRC_FTM)

         /* FTM0 channel 1 output source: FTM0_CH1 pin is output of FTM0 channel 1 output. */
         | SIM_SOPT8_FTM0OCH1SRC(SOPT8_FTM0OCH1SRC_FTM)

         /* FTM0 channel 2 output source: FTM0_CH2 pin is output of FTM0 channel 2 output. */
         | SIM_SOPT8_FTM0OCH2SRC(SOPT8_FTM0OCH2SRC_FTM)

         /* FTM0 channel 3 output source: FTM0_CH3 pin is output of FTM0 channel 3 output. */
         | SIM_SOPT8_FTM0OCH3SRC(SOPT8_FTM0OCH3SRC_FTM)

         /* FTM0 channel 4 output source: FTM0_CH4 pin is output of FTM0 channel 4 output. */
         | SIM_SOPT8_FTM0OCH4SRC(SOPT8_FTM0OCH4SRC_FTM)

         /* FTM0 channel 5 output source: FTM0_CH5 pin is output of FTM0 channel 5 output. */
         | SIM_SOPT8_FTM0OCH5SRC(SOPT8_FTM0OCH5SRC_FTM));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
PinTool_ADC:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '19', peripheral: ADC, signal: 'ADCA, 3', pin_signal: ADCA_CH3}
  - {pin_num: '11', peripheral: ADC, signal: 'ADCA, 1', pin_signal: ADCA_CH1/PTE17/LLWU_P19/SPI0_SCK/UART1_RX/FTM_CLKIN1/LPTMR0_ALT3}
  - {pin_num: '12', peripheral: ADC, signal: 'ADCB, 0', pin_signal: ADCB_CH0/PTE18/LLWU_P20/SPI0_SOUT/UART1_CTS_b/I2C0_SDA}
  - {pin_num: '13', peripheral: ADC, signal: 'ADCB, 1', pin_signal: ADCB_CH1/PTE19/SPI0_SIN/UART1_RTS_b/I2C0_SCL/CMP3_OUT}
  - {pin_num: '54', peripheral: ADC, signal: 'ADCB, 3', pin_signal: ADCB_CH3/PTB1/I2C0_SDA/FTM1_CH1/FTM0_FLT2/EWM_IN/FTM1_QD_PHB/UART0_TX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : PinTool_ADC
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void PinTool_ADC(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTB1 (pin 54) is configured as ADCB_CH3 */
    PORT_SetPinMux(BOARD_ADCB_PHB_PORT, BOARD_ADCB_PHB_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE17 (pin 11) is configured as ADCA_CH1 */
    PORT_SetPinMux(BOARD_ADCA_PHC_PORT, BOARD_ADCA_PHC_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE18 (pin 12) is configured as ADCB_CH0 */
    PORT_SetPinMux(BOARD_ADCB_UDCB_PORT, BOARD_ADCB_UDCB_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE19 (pin 13) is configured as ADCB_CH1 */
    PORT_SetPinMux(BOARD_ADCB_PHA_PORT, BOARD_ADCB_PHA_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
PinTool_UART:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '1', peripheral: UART1, signal: TX, pin_signal: ADCB_CH6f/PTE0/UART1_TX/XBAROUT10/XBARIN11}
  - {pin_num: '2', peripheral: UART1, signal: RX, pin_signal: ADCB_CH7f/PTE1/LLWU_P0/UART1_RX/XBAROUT11/XBARIN7}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

